garyPenhook/PyAvrOCD/svd/avr128da32.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DAC0</name>
      <description>Digital to Analog Converter</description>
      <baseAddress>0x008006A0</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRLA</name>
          <description>Control Register A</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>DAC Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTEN</name>
              <description>Output Buffer Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run in Standby Mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA</name>
          <description>DATA Register</description>
          <addressOffset>0x2</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data</description>
              <bitRange>[15:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>1023</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>EVSYS</name>
      <description>Event System</description>
      <baseAddress>0x00800200</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2C</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x30</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x33</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x35</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x3B</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x3F</offset>
        <size>0x6</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x49</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CHANNEL0</name>
          <description>Multiplexer Channel 0</description>
          <addressOffset>0x10</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHANNEL0</name>
              <description>Channel 0 generator select</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPDI_SYNCH</name>
                  <description>UPDI SYNCH character</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_OVF</name>
                  <description>Real Time Counter overflow</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CMP</name>
                  <description>Real Time Counter compare</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_PIT_DIV8192</name>
                  <description>Periodic Interrupt Timer output 0</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_PIT_DIV4096</name>
                  <description>Periodic Interrupt Timer output 1</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_PIT_DIV2048</name>
                  <description>Periodic Interrupt Timer output 2</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_PIT_DIV1024</name>
                  <description>Periodic Interrupt Timer output 3</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT0</name>
                  <description>Configurable Custom Logic LUT0</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT1</name>
                  <description>Configurable Custom Logic LUT1</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT2</name>
                  <description>Configurable Custom Logic LUT2</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT3</name>
                  <description>Configurable Custom Logic LUT3</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC0_OUT</name>
                  <description>Analog Comparator 0 out</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC1_OUT</name>
                  <description>Analog Comparator 1 out</description>
                  <value>33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC2_OUT</name>
                  <description>Analog Comparator 2 out</description>
                  <value>34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0_RESRDY</name>
                  <description>ADC 0 Result Ready</description>
                  <value>36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTC_RESRDY</name>
                  <description>PTC Result Ready</description>
                  <value>40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZCD0</name>
                  <description>Zero Cross Detect 0 out</description>
                  <value>48</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN0</name>
                  <description>Port A Pin 0</description>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN1</name>
                  <description>Port A Pin 1</description>
                  <value>65</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN2</name>
                  <description>Port A Pin 2</description>
                  <value>66</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN3</name>
                  <description>Port A Pin 3</description>
                  <value>67</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN4</name>
                  <description>Port A Pin 4</description>
                  <value>68</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN5</name>
                  <description>Port A Pin 5</description>
                  <value>69</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN6</name>
                  <description>Port A Pin 6</description>
                  <value>70</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN7</name>
                  <description>Port A Pin 7</description>
                  <value>71</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART0_XCK</name>
                  <description>USART 0 XCK</description>
                  <value>96</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART1_XCK</name>
                  <description>USART 1 XCK</description>
                  <value>97</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART2_XCK</name>
                  <description>USART 2 XCK</description>
                  <value>98</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0_SCK</name>
                  <description>SPI 0 SCK</description>
                  <value>104</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI1_SCK</name>
                  <description>SPI 1 SCK</description>
                  <value>105</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_OVF_LUNF</name>
                  <description>Timer/Counter A0 overflow / low byte timer underflow</description>
                  <value>128</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_HUNF</name>
                  <description>Timer/Counter A0 high byte timer underflow</description>
                  <value>129</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_CMP0_LCMP0</name>
                  <description>Timer/Counter A0 compare 0 / low byte timer compare 0</description>
                  <value>132</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_CMP1_LCMP1</name>
                  <description>Timer/Counter A0 compare 1 / low byte timer compare 1</description>
                  <value>133</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_CMP2_LCMP2</name>
                  <description>Timer/Counter A0 compare 2 / low byte timer compare 2</description>
                  <value>134</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA1_OVF_LUNF</name>
                  <description>Timer/Counter A1 overflow / low byte timer underflow</description>
                  <value>136</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB0_CAPT</name>
                  <description>Timer/Counter B0 capture</description>
                  <value>160</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB0_OVF</name>
                  <description>Timer/Counter B0 overflow</description>
                  <value>161</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB1_CAPT</name>
                  <description>Timer/Counter B1 capture</description>
                  <value>162</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB1_OVF</name>
                  <description>Timer/Counter B1 overflow</description>
                  <value>163</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB2_CAPT</name>
                  <description>Timer/Counter B2 capture</description>
                  <value>164</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB2_OVF</name>
                  <description>Timer/Counter B2 overflow</description>
                  <value>165</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_CMPBCLR</name>
                  <description>Timer/Counter D0 event 0</description>
                  <value>176</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_CMPASET</name>
                  <description>Timer/Counter D0 event 1</description>
                  <value>177</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_CMPBSET</name>
                  <description>Timer/Counter D0 event 2</description>
                  <value>178</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_PROGEV</name>
                  <description>Timer/Counter D0 event 3</description>
                  <value>179</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
